{
    "Storyline": "In CS Student Job Quest, you play as a dedicated computer science student navigating through academic and professional challenges. Each level symbolizes a phase in the journey—courses, coding tasks, and interviews—with the ultimate goal of securing a full-time tech job. The storyline blends both entertaining platformer elements and real-world CS education to immerse players in the ups and downs of a CS career path.",
    "Game mechanics": "This is a 2D platformer at its core, incorporating classic movement (run, jump, dodge) with educational mini-games and coding puzzles. Players collect code snippets to earn Skill Points (SP), which are spent unlocking new abilities. Overcoming obstacles or enemies often involves debugging platforms or creating temporary bridges, emphasizing both reflex-driven gameplay and problem-solving. Between levels, players tackle interviews (boss battles) featuring CS-related questions. The game also includes adaptive difficulty and AI-generated coding challenges for replayability and a tailored experience.",
    "Characters and Interactive entities": "Players control a CS student avatar. Enemies include 'procrastination monsters' and 'bug creatures,' each representing typical pitfalls in programming and time management. Interactive entities include platforms, coding terminals, and AI-driven NPCs that pose questions or offer guidance. Some NPCs function as interviewers or mentors, delivering challenges, dialogue, and feedback shaped by AI logic.",
    "Levels and difficulty": "Levels progress from introductory coursework to advanced programming challenges, mirroring a student’s academic and career trajectory. Difficulty scales with player performance and skill mastery, bolstered by an adaptive system. Early levels focus on platforming basics, while later stages blend in puzzle-solving, coding mini-games, and tougher interviews. Plans include at least ten levels, each potentially representing a new academic term, tech specialty, or job scenario. Boss battles (job interviews) ramp up in complexity, requiring both platforming and conceptual skills to succeed.",
    "Visual and audio style": "Visually, the game leans on pixel art reminiscent of retro platformers, maintaining a colorful and academic-themed atmosphere. Backgrounds depict campus environments, coding labs, and office settings, with a stylized, pixely aesthetic. Audio includes a looping soundtrack that intensifies during interviews and boss segments, along with options to mute or adjust volume from within the game. Future enhancements involve procedurally generated music influenced by gameplay states, further personalizing the game’s atmosphere."
}